wrk7_bak/wrk_1003_w_Heavy.txt
wrk -t 3 -c 3 -d180 -R 50 -math 1 --latency http://13.0.0.29:8081/high/web730m.html
Running 3m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52m    47.25s    2.80m    63.64%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    94502.91 ms
 75.000%    121110.53 ms
 90.000%    147324.93 ms
 99.000%    167903.23 ms
 99.900%    167903.23 ms
 99.990%    167903.23 ms
 99.999%    167903.23 ms
100.000%    167903.23 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10862.591     0.000000            1         1.00
   35422.207     0.100000            2         1.11
   48726.015     0.200000            3         1.25
   61931.519     0.300000            4         1.43
   75366.399     0.400000            5         1.67
   94502.911     0.500000            6         2.00
  108724.223     0.550000            7         2.22
  108724.223     0.600000            7         2.50
  121110.527     0.650000            8         2.86
  121110.527     0.700000            8         3.33
  134348.799     0.750000            9         4.00
  134348.799     0.775000            9         4.44
  134348.799     0.800000            9         5.00
  147324.927     0.825000           10         5.71
  147324.927     0.850000           10         6.67
  147324.927     0.875000           10         8.00
  147324.927     0.887500           10         8.89
  147324.927     0.900000           10        10.00
  167903.231     0.912500           11        11.43
  167903.231     1.000000           11          inf
#[Mean    =    91440.221, StdDeviation   =    47254.989]
#[Max     =   167772.160, Total count    =           11]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    10862.59 ms
 75.000%    11198.46 ms
 90.000%    17711.10 ms
 99.000%    21839.87 ms
 99.900%    21839.87 ms
 99.990%    21839.87 ms
 99.999%    21839.87 ms
100.000%    21839.87 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10543.103     0.000000            1         1.00
   10616.831     0.100000            2         1.11
   10625.023     0.200000            3         1.25
   10649.599     0.300000            4         1.43
   10788.863     0.400000            5         1.67
   10862.591     0.500000            6         2.00
   11149.311     0.550000            7         2.22
   11149.311     0.600000            7         2.50
   11198.463     0.650000            8         2.86
   11198.463     0.700000            8         3.33
   17580.031     0.750000            9         4.00
   17580.031     0.775000            9         4.44
   17580.031     0.800000            9         5.00
   17711.103     0.825000           10         5.71
   17711.103     0.850000           10         6.67
   17711.103     0.875000           10         8.00
   17711.103     0.887500           10         8.89
   17711.103     0.900000           10        10.00
   21839.871     0.912500           11        11.43
   21839.871     1.000000           11          inf
#[Mean    =    13046.132, StdDeviation   =     3815.605]
#[Max     =    21823.488, Total count    =           11]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11 requests in 3.00m, 8.23GB read
  Socket errors: connect 0, read 0, write 0, timeout 71
Requests/sec:      0.06
Transfer/sec:     46.80MB
Running 3m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.43m    47.18s    2.80m    60.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    77398.01 ms
 75.000%    120782.85 ms
 90.000%    145227.77 ms
 99.000%    168034.30 ms
 99.900%    168034.30 ms
 99.990%    168034.30 ms
 99.999%    168034.30 ms
100.000%    168034.30 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10895.359     0.000000            1         1.00
   10895.359     0.100000            1         1.11
   30752.767     0.200000            2         1.25
   50429.951     0.300000            3         1.43
   63864.831     0.400000            4         1.67
   77398.015     0.500000            5         2.00
   89784.319     0.550000            6         2.22
   89784.319     0.600000            6         2.50
  103022.591     0.650000            7         2.86
  103022.591     0.700000            7         3.33
  120782.847     0.750000            8         4.00
  120782.847     0.775000            8         4.44
  120782.847     0.800000            8         5.00
  145227.775     0.825000            9         5.71
  145227.775     0.850000            9         6.67
  145227.775     0.875000            9         8.00
  145227.775     0.887500            9         8.89
  145227.775     0.900000            9        10.00
  168034.303     0.912500           10        11.43
  168034.303     1.000000           10          inf
#[Mean    =    85988.557, StdDeviation   =    47175.707]
#[Max     =   167903.232, Total count    =           10]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    10895.36 ms
 75.000%    17104.90 ms
 90.000%    21135.36 ms
 99.000%    21626.88 ms
 99.900%    21626.88 ms
 99.990%    21626.88 ms
 99.999%    21626.88 ms
100.000%    21626.88 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10534.911     0.000000            1         1.00
   10534.911     0.100000            1         1.11
   10649.599     0.200000            2         1.25
   10682.367     0.300000            3         1.43
   10747.903     0.400000            4         1.67
   10895.359     0.500000            5         2.00
   16015.359     0.550000            6         2.22
   16015.359     0.600000            6         2.50
   16908.287     0.650000            7         2.86
   16908.287     0.700000            7         3.33
   17104.895     0.750000            8         4.00
   17104.895     0.775000            8         4.44
   17104.895     0.800000            8         5.00
   21135.359     0.825000            9         5.71
   21135.359     0.850000            9         6.67
   21135.359     0.875000            9         8.00
   21135.359     0.887500            9         8.89
   21135.359     0.900000            9        10.00
   21626.879     0.912500           10        11.43
   21626.879     1.000000           10          inf
#[Mean    =    14624.358, StdDeviation   =     4261.183]
#[Max     =    21610.496, Total count    =           10]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10 requests in 3.02m, 7.80GB read
  Socket errors: connect 0, read 0, write 0, timeout 74
Requests/sec:      0.06
Transfer/sec:     44.16MB
Running 3m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52m    50.41s    2.79m    54.55%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    94109.70 ms
 75.000%    123797.50 ms
 90.000%    154271.74 ms
 99.000%    167378.94 ms
 99.900%    167378.94 ms
 99.990%    167378.94 ms
 99.999%    167378.94 ms
100.000%    167378.94 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11509.759     0.000000            1         1.00
   24690.687     0.100000            2         1.11
   45088.767     0.200000            3         1.25
   59113.471     0.300000            4         1.43
   72351.743     0.400000            5         1.67
   94109.695     0.500000            6         2.00
  107479.039     0.550000            7         2.22
  107479.039     0.600000            7         2.50
  123797.503     0.650000            8         2.86
  123797.503     0.700000            8         3.33
  141950.975     0.750000            9         4.00
  141950.975     0.775000            9         4.44
  141950.975     0.800000            9         5.00
  154271.743     0.825000           10         5.71
  154271.743     0.850000           10         6.67
  154271.743     0.875000           10         8.00
  154271.743     0.887500           10         8.89
  154271.743     0.900000           10        10.00
  167378.943     0.912500           11        11.43
  167378.943     1.000000           11          inf
#[Mean    =    91033.600, StdDeviation   =    50411.971]
#[Max     =   167247.872, Total count    =           11]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    11354.11 ms
 75.000%    14598.14 ms
 90.000%    17858.56 ms
 99.000%    19824.64 ms
 99.900%    19824.64 ms
 99.990%    19824.64 ms
 99.999%    19824.64 ms
100.000%    19824.64 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10379.263     0.000000            1         1.00
   10518.527     0.100000            2         1.11
   10608.639     0.200000            3         1.25
   10633.215     0.300000            4         1.43
   10706.943     0.400000            5         1.67
   11354.111     0.500000            6         2.00
   11509.759     0.550000            7         2.22
   11509.759     0.600000            7         2.50
   14598.143     0.650000            8         2.86
   14598.143     0.700000            8         3.33
   15359.999     0.750000            9         4.00
   15359.999     0.775000            9         4.44
   15359.999     0.800000            9         5.00
   17858.559     0.825000           10         5.71
   17858.559     0.850000           10         6.67
   17858.559     0.875000           10         8.00
   17858.559     0.887500           10         8.89
   17858.559     0.900000           10        10.00
   19824.639     0.912500           11        11.43
   19824.639     1.000000           11          inf
#[Mean    =    13027.142, StdDeviation   =     3201.316]
#[Max     =    19808.256, Total count    =           11]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11 requests in 3.02m, 8.48GB read
  Socket errors: connect 0, read 0, write 0, timeout 72
Requests/sec:      0.06
Transfer/sec:     47.88MB